zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE327/MCXE327_cm7_core1_COMMON.h
/*******************************************************************************
 * Definitions
*******************************************************************************/

/*!
 * @brief Structure for the TRGMUX source
 *
 * Defines the structure for the TRGMUX source collections.
 */
typedef enum _trgmux_source
{
    kTRGMUX_SourceDisabled          = 0U,          /**< Trigger function is disabled */
    kTRGMUX_SourceAlwaysHigh        = 1U,          /**< Trigger function is always high */
    kTRGMUX_SourceAdc0Eoc           = 2U,          /**< ADC0 End of Conversion is selected */
    kTRGMUX_SourceAdc1Eoc           = 3U,          /**< ADC1 End of Conversion is selected */
    kTRGMUX_SourceLpcmp0            = 5U,          /**< LPCMP_0 Comparator output is selected */
    kTRGMUX_SourceLpcmp1            = 6U,          /**< LPCMP_1 Comparator output is selected */
    kTRGMUX_SourceDmaCh0            = 8U,          /**< eDMA Channel 0 Done is selected */
    kTRGMUX_SourceDmaCh1            = 9U,          /**< eDMA Channel 1 Done is selected */
    kTRGMUX_SourceDmaCh16           = 10U,         /**< eDMA Channel 16 Done is selected */
    kTRGMUX_SourceDmaCh17           = 11U,         /**< eDMA Channel 17 Done is selected */
    kTRGMUX_SourceEmios0ReloadOutCh23 = 12U,       /**< eMIOS_0 Reload Out Ch23 is selected */
    kTRGMUX_SourceEmios0ReloadOutCh22 = 13U,       /**< eMIOS_0 Reload Out Ch22 is selected */
    kTRGMUX_SourceEmios0ReloadOutCh8 = 14U,        /**< eMIOS_0 Reload Out Ch8 is selected */
    kTRGMUX_SourceEmios0ReloadOutCh0 = 15U,        /**< eMIOS_0 Reload Out Ch0 is selected */
    kTRGMUX_SourceEmios0IppDoEmiosCh0 = 16U,       /**< eMIOS_0_IPP_DO_eMIOS_CH[0] is selected */
    kTRGMUX_SourceEmios0IppDoEmiosCh1 = 17U,       /**< eMIOS_0_IPP_DO_eMIOS_CH[1] is selected */
    kTRGMUX_SourceEmios0IppDoEmiosCh2 = 18U,       /**< eMIOS_0_IPP_DO_eMIOS_CH[2] is selected */
    kTRGMUX_SourceEmios0IppDoEmiosCh3 = 19U,       /**< eMIOS_0_IPP_DO_eMIOS_CH[3] is selected */
    kTRGMUX_SourceEmios0IppDoEmiosCh4 = 20U,       /**< eMIOS_0_IPP_DO_eMIOS_CH[4] is selected */
    kTRGMUX_SourceEmios0IppDoEmiosCh5 = 21U,       /**< eMIOS_0_IPP_DO_eMIOS_CH[5] is selected */
    kTRGMUX_SourceEmios0IppDoEmiosCh6 = 22U,       /**< eMIOS_0_IPP_DO_eMIOS_CH[6] is selected */
    kTRGMUX_SourceEmios0IppDoEmiosCh7 = 23U,       /**< eMIOS_0_IPP_DO_eMIOS_CH[7] is selected */
    kTRGMUX_SourceEmios0IppDoEmiosCh8 = 24U,       /**< eMIOS_0_IPP_DO_eMIOS_CH[8] is selected */
    kTRGMUX_SourceEmios0IppDoEmiosCh9 = 25U,       /**< eMIOS_0_IPP_DO_eMIOS_CH[9] is selected */
    kTRGMUX_SourceEmios0IppDoEmiosCh10 = 26U,      /**< eMIOS_0_IPP_DO_eMIOS_CH[10] is selected */
    kTRGMUX_SourceEmios0IppDoEmiosCh11 = 27U,      /**< eMIOS_0_IPP_DO_eMIOS_CH[11] is selected */
    kTRGMUX_SourceEmios0IppDoEmiosCh12 = 28U,      /**< eMIOS_0_IPP_DO_eMIOS_CH[12] is selected */
    kTRGMUX_SourceEmios0IppDoEmiosCh13 = 29U,      /**< eMIOS_0_IPP_DO_eMIOS_CH[13] is selected */
    kTRGMUX_SourceEmios0IppDoEmiosCh14 = 30U,      /**< eMIOS_0_IPP_DO_eMIOS_CH[14] is selected */
    kTRGMUX_SourceEmios0IppDoEmiosCh15 = 31U,      /**< eMIOS_0_IPP_DO_eMIOS_CH[15] is selected */
    kTRGMUX_SourceEmios0IppDoEmiosCh22 = 32U,      /**< eMIOS_0_IPP_DO_eMIOS_CH[22] is selected */
    kTRGMUX_SourceEmios0IppDoEmiosCh23 = 33U,      /**< eMIOS_0_IPP_DO_eMIOS_CH[23] is selected */
    kTRGMUX_SourceEmios1ReloadOutCh23 = 34U,       /**< eMIOS_1 Reload Out Ch23 is selected */
    kTRGMUX_SourceEmios1ReloadOutCh22 = 35U,       /**< eMIOS_1 Reload Out Ch22 is selected */
    kTRGMUX_SourceEmios1ReloadOutCh8 = 36U,        /**< eMIOS_1 Reload Out Ch8 is selected */
    kTRGMUX_SourceEmios1ReloadOutCh0 = 37U,        /**< eMIOS_1 Reload Out Ch0 is selected */
    kTRGMUX_SourceEmios1IppDoEmiosCh0 = 38U,       /**< eMIOS_1_IPP_DO_eMIOS_CH[0] is selected */
    kTRGMUX_SourceEmios1IppDoEmiosCh1 = 39U,       /**< eMIOS_1_IPP_DO_eMIOS_CH[1] is selected */
    kTRGMUX_SourceEmios1IppDoEmiosCh2 = 40U,       /**< eMIOS_1_IPP_DO_eMIOS_CH[2] is selected */
    kTRGMUX_SourceEmios1IppDoEmiosCh3 = 41U,       /**< eMIOS_1_IPP_DO_eMIOS_CH[3] is selected */
    kTRGMUX_SourceEmios1IppDoEmiosCh4 = 42U,       /**< eMIOS_1_IPP_DO_eMIOS_CH[4] is selected */
    kTRGMUX_SourceEmios1IppDoEmiosCh5 = 43U,       /**< eMIOS_1_IPP_DO_eMIOS_CH[5] is selected */
    kTRGMUX_SourceEmios1IppDoEmiosCh6 = 44U,       /**< eMIOS_1_IPP_DO_eMIOS_CH[6] is selected */
    kTRGMUX_SourceEmios1IppDoEmiosCh7 = 45U,       /**< eMIOS_1_IPP_DO_eMIOS_CH[7] is selected */
    kTRGMUX_SourceEmios1IppDoEmiosCh8 = 46U,       /**< eMIOS_1_IPP_DO_eMIOS_CH[8] is selected */
    kTRGMUX_SourceEmios1IppDoEmiosCh9 = 47U,       /**< eMIOS_1_IPP_DO_eMIOS_CH[9] is selected */
    kTRGMUX_SourceEmios1IppDoEmiosCh10 = 48U,      /**< eMIOS_1_IPP_DO_eMIOS_CH[10] is selected */
    kTRGMUX_SourceEmios1IppDoEmiosCh11 = 49U,      /**< eMIOS_1_IPP_DO_eMIOS_CH[11] is selected */
    kTRGMUX_SourceEmios1IppDoEmiosCh12 = 50U,      /**< eMIOS_1_IPP_DO_eMIOS_CH[12] is selected */
    kTRGMUX_SourceEmios1IppDoEmiosCh13 = 51U,      /**< eMIOS_1_IPP_DO_eMIOS_CH[13] is selected */
    kTRGMUX_SourceEmios1IppDoEmiosCh14 = 52U,      /**< eMIOS_1_IPP_DO_eMIOS_CH[14] is selected */
    kTRGMUX_SourceEmios1IppDoEmiosCh15 = 53U,      /**< eMIOS_1_IPP_DO_eMIOS_CH[15] is selected */
    kTRGMUX_SourceEmios1IppDoEmiosCh22 = 54U,      /**< eMIOS_1_IPP_DO_eMIOS_CH[22] is selected */
    kTRGMUX_SourceEmios1IppDoEmiosCh23 = 55U,      /**< eMIOS_1_IPP_DO_eMIOS_CH[23] is selected */
    kTRGMUX_SourceFlexIOTrg0        = 56U,         /**< FLEXIO Trigger 0 is selected */
    kTRGMUX_SourceFlexIOTrg1        = 57U,         /**< FLEXIO Trigger 1 is selected */
    kTRGMUX_SourceFlexIOTrg2        = 58U,         /**< FLEXIO Trigger 2 is selected */
    kTRGMUX_SourceFlexIOTrg3        = 59U,         /**< FLEXIO Trigger 3 is selected */
    kTRGMUX_SourceTriggerMuxInput0  = 60U,         /**< SIUL2 TRGMUX IN0 is selected */
    kTRGMUX_SourceTriggerMuxInput1  = 61U,         /**< SIUL2 TRGMUX IN1 is selected */
    kTRGMUX_SourceTriggerMuxInput2  = 62U,         /**< SIUL2 TRGMUX IN2 is selected */
    kTRGMUX_SourceTriggerMuxInput3  = 63U,         /**< SIUL2 TRGMUX IN3 is selected */
    kTRGMUX_SourceTriggerMuxInput4  = 64U,         /**< SIUL2 TRGMUX IN4 is selected */
    kTRGMUX_SourceTriggerMuxInput5  = 65U,         /**< SIUL2 TRGMUX IN5 is selected */
    kTRGMUX_SourceTriggerMuxInput6  = 66U,         /**< SIUL2 TRGMUX IN6 is selected */
    kTRGMUX_SourceTriggerMuxInput7  = 67U,         /**< SIUL2 TRGMUX IN7 is selected */
    kTRGMUX_SourceTriggerMuxInput8  = 68U,         /**< SIUL2 TRGMUX IN8 is selected */
    kTRGMUX_SourceTriggerMuxInput9  = 69U,         /**< SIUL2 TRGMUX IN9 is selected */
    kTRGMUX_SourceTriggerMuxInput10 = 70U,         /**< SIUL2 TRGMUX IN10 is selected */
    kTRGMUX_SourceTriggerMuxInput11 = 71U,         /**< SIUL2 TRGMUX IN11 is selected */
    kTRGMUX_SourceTriggerMuxInput12 = 72U,         /**< SIUL2 TRGMUX IN12 is selected */
    kTRGMUX_SourceTriggerMuxInput13 = 73U,         /**< SIUL2 TRGMUX IN13 is selected */
    kTRGMUX_SourceTriggerMuxInput14 = 74U,         /**< SIUL2 TRGMUX IN14 is selected */
    kTRGMUX_SourceTriggerMuxInput15 = 75U,         /**< SIUL2 TRGMUX IN15 is selected */
    kTRGMUX0_SourceLpi2c0Master     = 76U,         /**< LPI2C_0 Master trigger is selected */
    kTRGMUX0_SourceLpi2c0Slave      = 77U,         /**< LPI2C_0 Slave trigger is selected */
    kTRGMUX0_SourceLpspi0Frame      = 78U,         /**< LPSPI0 End of Frame is selected */
    kTRGMUX0_SourceLpspi0RxData     = 79U,         /**< LPSPI0 RX Data input is selected */
    kTRGMUX0_SourceLpspi1Frame      = 80U,         /**< LPSPI1 End of Frame is selected */
    kTRGMUX0_SourceLpspi1RxData     = 81U,         /**< LPSPI1 RX Data input is selected */
    kTRGMUX0_SourceLpspi2Frame      = 82U,         /**< LPSPI2 End of Frame is selected */
    kTRGMUX0_SourceLpspi2RxData     = 83U,         /**< LPSPI2 RX Data input is selected */
    kTRGMUX0_SourceLpuart0TxData    = 84U,         /**< LPUART0 TX Data input is selected */
    kTRGMUX0_SourceLpuart0RxData    = 85U,         /**< LPUART0 RX Data input is selected */
    kTRGMUX0_SourceLpuart0RxIdle    = 86U,         /**< LPUART0 RX Idle input is selected */
    kTRGMUX0_SourceLpuart1TxData    = 87U,         /**< LPUART1 TX Data input is selected */
    kTRGMUX0_SourceLpuart1RxData    = 88U,         /**< LPUART1 RX Data input is selected */
    kTRGMUX0_SourceLpuart1RxIdle    = 89U,         /**< LPUART1 RX Idle input is selected */
    kTRGMUX0_SourceLpuart2TxData    = 90U,         /**< LPUART2 TX Data input is selected */
    kTRGMUX0_SourceLpuart2RxData    = 91U,         /**< LPUART2 RX Data input is selected */
    kTRGMUX0_SourceLpuart2RxIdle    = 92U,         /**< LPUART2 RX Idle input is selected */
    kTRGMUX_SourceLcu0Lc0Out0       = 93U,         /**< LCU_0 LC0 Out_i0 is selected */
    kTRGMUX_SourceLcu0Lc0Out1       = 94U,         /**< LCU_0 LC0 Out_i1 is selected */
    kTRGMUX_SourceLcu0Lc0Out2       = 95U,         /**< LCU_0 LC0 Out_i2 is selected */
    kTRGMUX_SourceLcu0Lc0Out3       = 96U,         /**< LCU_0 LC0 Out_i3 is selected */
    kTRGMUX_SourceLcu0Lc1Out0       = 97U,         /**< LCU_0 LC1 Out_i0 is selected */
    kTRGMUX_SourceLcu0Lc1Out1       = 98U,         /**< LCU_0 LC1 Out_i1 is selected */
    kTRGMUX_SourceLcu0Lc1Out2       = 99U,         /**< LCU_0 LC1 Out_i2 is selected */
    kTRGMUX_SourceLcu0Lc1Out3       = 100U,        /**< LCU_0 LC1 Out_i3 is selected */
    kTRGMUX_SourceLcu0Lc2Out0       = 101U,        /**< LCU_0 LC2 Out_i0 is selected */
    kTRGMUX_SourceLcu0Lc2Out1       = 102U,        /**< LCU_0 LC2 Out_i1 is selected */
    kTRGMUX_SourceLcu0Lc2Out2       = 103U,        /**< LCU_0 LC2 Out_i2 is selected */
    kTRGMUX_SourceLcu0Lc2Out3       = 104U,        /**< LCU_0 LC2 Out_i3 is selected */
    kTRGMUX_SourceLcu1Lc0Out0       = 105U,        /**< LCU_1 LC0 Out_i0 is selected */
    kTRGMUX_SourceLcu1Lc0Out1       = 106U,        /**< LCU_1 LC0 Out_i1 is selected */
    kTRGMUX_SourceLcu1Lc0Out2       = 107U,        /**< LCU_1 LC0 Out_i2 is selected */
    kTRGMUX_SourceLcu1Lc0Out3       = 108U,        /**< LCU_1 LC0 Out_i3 is selected */
    kTRGMUX_SourceLcu1Lc1Out0       = 109U,        /**< LCU_1 LC1 Out_i0 is selected */
    kTRGMUX_SourceLcu1Lc1Out1       = 110U,        /**< LCU_1 LC1 Out_i1 is selected */
    kTRGMUX_SourceLcu1Lc1Out2       = 111U,        /**< LCU_1 LC1 Out_i2 is selected */
    kTRGMUX_SourceLcu1Lc1Out3       = 112U,        /**< LCU_1 LC1 Out_i3 is selected */
    kTRGMUX_SourceLcu1Lc2Out0       = 113U,        /**< LCU_1 LC2 Out_i0 is selected */
    kTRGMUX_SourceLcu1Lc2Out1       = 114U,        /**< LCU_1 LC2 Out_i1 is selected */
    kTRGMUX_SourceLcu1Lc2Out2       = 115U,        /**< LCU_1 LC2 Out_i2 is selected */
    kTRGMUX_SourceLcu1Lc2Out3       = 116U,        /**< LCU_1 LC2 Out_i3 is selected */
    kTRGMUX_SourcePit0Ch0           = 117U,        /**< PIT0 Channel0 is selected */
    kTRGMUX_SourcePit0Ch1           = 118U,        /**< PIT0 Channel1 is selected */
    kTRGMUX_SourcePit0Ch2           = 119U,        /**< PIT0 Channel2 is selected */
    kTRGMUX_SourcPit0Ch3            = 120U,        /**< PIT0 Channel3 is selected */
    kTRGMUX_SourcPit0Ch4Rti         = 121U,        /**< PIT0 Channel4 RTI is selected */
    kTRGMUX_SourcePit1Ch0           = 122U,        /**< PIT1 Channel0 is selected */
    kTRGMUX_SourcePit1Ch1           = 123U,        /**< PIT1 Channel1 is selected */
    kTRGMUX_SourcePit1Ch2           = 124U,        /**< PIT1 Channel2 is selected */
    kTRGMUX_SourcPit1Ch3            = 125U,        /**< PIT1 Channel3 is selected */
    kTRGMUX_SourcCm7Txev            = 126U,        /**< CM7 TXEV is selected */
} trgmux_source_t;

/*!
 * @brief Structure for the TRGMUX device
 *
 * Defines the structure for the TRGMUX device collections.
 */
typedef enum _trgmux_device
{
    kTRGMUX_Adc0                    = 0U,          /**< ADC_0 device trigger input */
    kTRGMUX_Adc1                    = 1U,          /**< ADC_1 device trigger input */
    kTRGMUX_Adc2                    = 2U,          /**< ADC_2 device trigger input */
    kTRGMUX_Lpcmp0                  = 3U,          /**< LPCMP_0 device trigger input */
    kTRGMUX_Lpcmp1                  = 4U,          /**< LPCMP_1 device trigger input */
    kTRGMUX_Lpcmp2                  = 5U,          /**< LPCMP_2 device trigger input */
    kTRGMUX_Bctu                    = 6U,          /**< BCTU device trigger input */
    kTRGMUX_Emios012_Odis           = 7U,          /**< eMIOS012_ODIS device trigger input */
    kTRGMUX_Emios0_0                = 8U,          /**< eMIOS0_0 device trigger input */
    kTRGMUX_Emios0_1                = 9U,          /**< eMIOS0_1 device trigger input */
    kTRGMUX_Emios0_2                = 10U,         /**< eMIOS0_2 device trigger input */
    kTRGMUX_Emios0_3                = 11U,         /**< eMIOS0_3 device trigger input */
    kTRGMUX_Emios1_0                = 12U,         /**< eMIOS1_0 device trigger input */
    kTRGMUX_Emios1_1                = 13U,         /**< eMIOS1_1 device trigger input */
    kTRGMUX_Emios1_2                = 14U,         /**< eMIOS1_2 device trigger input */
    kTRGMUX_Emios1_3                = 15U,         /**< eMIOS1_3 device trigger input */
    kTRGMUX_Flexio                  = 16U,         /**< FLEXIO device trigger input */
    kTRGMUX_ExtOut0                 = 17U,         /**< SIUL2 TRGMUX_OUT0 device trigger input */
    kTRGMUX_ExtOut1                 = 18U,         /**< SIUL2 TRGMUX_OUT1 device trigger input */
    kTRGMUX_ExtOut2                 = 19U,         /**< SIUL2 TRGMUX_OUT2 device trigger input */
    kTRGMUX_ExtOut3                 = 20U,         /**< SIUL2 TRGMUX_OUT3 device trigger input */
    kTRGMUX_Lpi2c0                  = 21U,         /**< LPI2C_0 device trigger input */
    kTRGMUX_Lpspi0                  = 22U,         /**< LPSPI_0 device trigger input */
    kTRGMUX_Lpspi1                  = 23U,         /**< LPSPI_1 device trigger input */
    kTRGMUX_Lpspi2                  = 24U,         /**< LPSPI_2 device trigger input */
    kTRGMUX_Lpuart0                 = 25U,         /**< LPUART_0 device trigger input */
    kTRGMUX_Lpuart1                 = 26U,         /**< LPUART_1 device trigger input */
    kTRGMUX_Lpuart2                 = 27U,         /**< LPUART_2 device trigger input */
    kTRGMUX_Lpuart3                 = 28U,         /**< LPUART_3 device trigger input */
    kTRGMUX_Lcu0Sync                = 29U,         /**< LCU0_SYNC device trigger input */
    kTRGMUX_Lcu0Force               = 30U,         /**< LCU0_FORCE device trigger input */
    kTRGMUX_Lcu0_0                  = 31U,         /**< LCU0_0 device trigger input */
    kTRGMUX_Lcu0_1                  = 32U,         /**< LCU0_1 device trigger input */
    kTRGMUX_Lcu0_2                  = 33U,         /**< LCU0_2 device trigger input */
    kTRGMUX_Lcu1Sync                = 34U,         /**< LCU1_SYNC device trigger input */
    kTRGMUX_Lcu1Force               = 35U,         /**< LCU1_FORCE device trigger input */
    kTRGMUX_Lcu1_0                  = 36U,         /**< LCU1_0 device trigger input */
    kTRGMUX_Lcu1_1                  = 37U,         /**< LCU1_1 device trigger input */
    kTRGMUX_Lcu1_2                  = 38U,         /**< LCU1_2 device trigger input */
    kTRGMUX_Cm7Rxev                 = 39U,         /**< CM7_RXEV device trigger input */
} trgmux_device_t;

/* @} */

/*!
 * @addtogroup tspc_group1_pad
 * @{ */

