zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE327/MCXE327_cm7_core1_COMMON.h
/* PLL - Peripheral instance base addresses */
/** Peripheral PLL base address */
#define PLL_BASE                                 (0x402E0000u)
/** Peripheral PLL base pointer */
#define PLL                                      ((PLL_Type *)PLL_BASE)
/** Array initializer of PLL peripheral base addresses */
#define PLL_BASE_ADDRS                           { PLL_BASE }
/** Array initializer of PLL peripheral base pointers */
#define PLL_BASE_PTRS                            { PLL }

/* PMC - Peripheral instance base addresses */
/** Peripheral PMC base address */
#define PMC_BASE                                 (0x402E8000u)
/** Peripheral PMC base pointer */
#define PMC                                      ((PMC_Type *)PMC_BASE)
/** Array initializer of PMC peripheral base addresses */
#define PMC_BASE_ADDRS                           { PMC_BASE }
/** Array initializer of PMC peripheral base pointers */
#define PMC_BASE_PTRS                            { PMC }

/* PRAMC - Peripheral instance base addresses */
/** Peripheral PRAMC_0 base address */
#define PRAMC_0_BASE                             (0x40264000u)
/** Peripheral PRAMC_0 base pointer */
#define PRAMC_0                                  ((PRAMC_Type *)PRAMC_0_BASE)
/** Array initializer of PRAMC peripheral base addresses */
#define PRAMC_BASE_ADDRS                         { PRAMC_0_BASE }
/** Array initializer of PRAMC peripheral base pointers */
#define PRAMC_BASE_PTRS                          { PRAMC_0 }

/* QuadSPI - Peripheral instance base addresses */
/** Peripheral QUADSPI base address */
#define QUADSPI_BASE                             (0x404CC000u)
/** Peripheral QUADSPI base pointer */
#define QUADSPI                                  ((QuadSPI_Type *)QUADSPI_BASE)
/** Array initializer of QuadSPI peripheral base addresses */
#define QuadSPI_BASE_ADDRS                       { QUADSPI_BASE }
/** Array initializer of QuadSPI peripheral base pointers */
#define QuadSPI_BASE_PTRS                        { QUADSPI }
/** Interrupt vectors for the QuadSPI peripheral type */
#define QuadSPI_IRQS                             { QSPI_IRQn }

/* QuadSPI_ARDB - Peripheral instance base addresses */
/** Peripheral QUADSPI_ARDB base address */
#define QUADSPI_ARDB_BASE                        (0x68000000u)
/** Peripheral QUADSPI_ARDB base pointer */
#define QUADSPI_ARDB                             ((QuadSPI_ARDB_Type *)QUADSPI_ARDB_BASE)
/** Array initializer of QuadSPI_ARDB peripheral base addresses */
#define QuadSPI_ARDB_BASE_ADDRS                  { QUADSPI_ARDB_BASE }
/** Array initializer of QuadSPI_ARDB peripheral base pointers */
#define QuadSPI_ARDB_BASE_PTRS                   { QUADSPI_ARDB }

/* RTC - Peripheral instance base addresses */
/** Peripheral RTC base address */
#define RTC_BASE                                 (0x40288000u)
/** Peripheral RTC base pointer */
#define RTC                                      ((RTC_Type *)RTC_BASE)
/** Array initializer of RTC peripheral base addresses */
#define RTC_BASE_ADDRS                           { RTC_BASE }
/** Array initializer of RTC peripheral base pointers */
#define RTC_BASE_PTRS                            { RTC }
/** Interrupt vectors for the RTC peripheral type */
#define RTC_IRQS                                 { RTC_IRQn }

/* SDA_AP - Peripheral instance base addresses */
/** Peripheral SDA_AP base address */
#define SDA_AP_BASE                              (0x40254700u)
/** Peripheral SDA_AP base pointer */
#define SDA_AP                                   ((SDA_AP_Type *)SDA_AP_BASE)
/** Array initializer of SDA_AP peripheral base addresses */
#define SDA_AP_BASE_ADDRS                        { SDA_AP_BASE }
/** Array initializer of SDA_AP peripheral base pointers */
#define SDA_AP_BASE_PTRS                         { SDA_AP }

/* SEMA42 - Peripheral instance base addresses */
/** Peripheral SEMA42 base address */
#define SEMA42_BASE                              (0x40460000u)
/** Peripheral SEMA42 base pointer */
#define SEMA42                                   ((SEMA42_Type *)SEMA42_BASE)
/** Array initializer of SEMA42 peripheral base addresses */
#define SEMA42_BASE_ADDRS                        { SEMA42_BASE }
/** Array initializer of SEMA42 peripheral base pointers */
#define SEMA42_BASE_PTRS                         { SEMA42 }

/* SIRC - Peripheral instance base addresses */
/** Peripheral SIRC base address */
#define SIRC_BASE                                (0x402C8000u)
/** Peripheral SIRC base pointer */
#define SIRC                                     ((SIRC_Type *)SIRC_BASE)
/** Array initializer of SIRC peripheral base addresses */
#define SIRC_BASE_ADDRS                          { SIRC_BASE }
/** Array initializer of SIRC peripheral base pointers */
#define SIRC_BASE_PTRS                           { SIRC }

/* SIUL2 - Peripheral instance base addresses */
/** Peripheral SIUL2 base address */
#define SIUL2_BASE                               (0x40290000u)
/** Peripheral SIUL2 base pointer */
#define SIUL2                                    ((SIUL2_Type *)SIUL2_BASE)
/** Array initializer of SIUL2 peripheral base addresses */
#define SIUL2_BASE_ADDRS                         { SIUL2_BASE }
/** Array initializer of SIUL2 peripheral base pointers */
#define SIUL2_BASE_PTRS                          { SIUL2 }
/** Interrupt vectors for the SIUL2 peripheral type */
#define SIUL2_IRQS                               { { SIUL2_0_IRQn, SIUL2_1_IRQn, SIUL2_2_IRQn, SIUL2_3_IRQn } }
/*! Maximum pins which share the same EIRQ request */
#define SIUL2_MAX_PINS_PER_EIRQ                  (4U)
/*! Pins and EIRQ mapping array */
#define SIUL2_EIRQ_PINS_MAP                      {{0, 18, 64, 128}, {1, 19, 65, 129}, {2, 20, 66, 130}, {3, 21, 67, 131}, {4, 16, 68, 132}, {5, 25, 69, 133}, {6, 28, 70, 134}, {7, 30, 71, 136}, \
                                                  {32, 53, 96, 137}, {33, 54, 97, 138}, {34, 55, 98, 139}, {35, 56, 99, 140}, {36, 57, 100, 141}, {37, 58, 101, 142}, {40, 60, 102, 143}, {41, 103, 144, -1}, \
                                                  {8, 72, 84, -1}, {9, 73, 85, -1}, {10, 74, 87, -1}, {11, 75, 88, -1}, {12, 76, 89, -1}, {13, 77, 90, -1}, {14, 78, 91, -1}, {15, 79, 93, -1}, \
                                                  {42, 104, 113, -1}, {43, 105, 116, -1}, {44, 106, 117, -1}, {45, 107, 118, -1}, {46, 108, 119, -1}, {47, 109, 120, -1}, {48, 110, 123, -1}, {49, 111, 124, -1}}


/* STCU - Peripheral instance base addresses */
/** Peripheral STCU base address */
#define STCU_BASE                                (0x403A0000u)
/** Peripheral STCU base pointer */
#define STCU                                     ((STCU_Type *)STCU_BASE)
/** Array initializer of STCU peripheral base addresses */
#define STCU_BASE_ADDRS                          { STCU_BASE }
/** Array initializer of STCU peripheral base pointers */
#define STCU_BASE_PTRS                           { STCU }

/* STM - Peripheral instance base addresses */
/** Peripheral STM_0 base address */
#define STM_0_BASE                               (0x40274000u)
/** Peripheral STM_0 base pointer */
#define STM_0                                    ((STM_Type *)STM_0_BASE)
/** Peripheral STM_1 base address */
#define STM_1_BASE                               (0x40474000u)
/** Peripheral STM_1 base pointer */
#define STM_1                                    ((STM_Type *)STM_1_BASE)
/** Array initializer of STM peripheral base addresses */
#define STM_BASE_ADDRS                           { STM_0_BASE, STM_1_BASE }
/** Array initializer of STM peripheral base pointers */
#define STM_BASE_PTRS                            { STM_0, STM_1 }
/** Interrupt vectors for the STM peripheral type */
#define STM_IRQS                                 { STM0_IRQn, STM1_IRQn }

/* SWT - Peripheral instance base addresses */
/** Peripheral SWT_0 base address */
#define SWT_0_BASE                               (0x40270000u)
/** Peripheral SWT_0 base pointer */
#define SWT_0                                    ((SWT_Type *)SWT_0_BASE)
/** Peripheral SWT_1 base address */
#define SWT_1_BASE                               (0x4046C000u)
/** Peripheral SWT_1 base pointer */
#define SWT_1                                    ((SWT_Type *)SWT_1_BASE)
/** Array initializer of SWT peripheral base addresses */
#define SWT_BASE_ADDRS                           { SWT_0_BASE, SWT_1_BASE }
/** Array initializer of SWT peripheral base pointers */
#define SWT_BASE_PTRS                            { SWT_0, SWT_1 }
/** Interrupt vectors for the SWT peripheral type */
#define SWT_IRQS                                 { SWT0_IRQn, NotAvail_IRQn }

/* SXOSC - Peripheral instance base addresses */
/** Peripheral SXOSC base address */
#define SXOSC_BASE                               (0x402CC000u)
/** Peripheral SXOSC base pointer */
#define SXOSC                                    ((SXOSC_Type *)SXOSC_BASE)
/** Array initializer of SXOSC peripheral base addresses */
#define SXOSC_BASE_ADDRS                         { SXOSC_BASE }
/** Array initializer of SXOSC peripheral base pointers */
#define SXOSC_BASE_PTRS                          { SXOSC }

/* TEMPSENSE - Peripheral instance base addresses */
/** Peripheral TEMPSENSE base address */
#define TEMPSENSE_BASE                           (0x4037C000u)
/** Peripheral TEMPSENSE base pointer */
#define TEMPSENSE                                ((TEMPSENSE_Type *)TEMPSENSE_BASE)
/** Array initializer of TEMPSENSE peripheral base addresses */
#define TEMPSENSE_BASE_ADDRS                     { TEMPSENSE_BASE }
/** Array initializer of TEMPSENSE peripheral base pointers */
#define TEMPSENSE_BASE_PTRS                      { TEMPSENSE }

/* TRGMUX - Peripheral instance base addresses */
/** Peripheral TRGMUX base address */
#define TRGMUX_BASE                              (0x40080000u)
/** Peripheral TRGMUX base pointer */
#define TRGMUX                                   ((TRGMUX_Type *)TRGMUX_BASE)
/** Array initializer of TRGMUX peripheral base addresses */
#define TRGMUX_BASE_ADDRS                        { TRGMUX_BASE }
/** Array initializer of TRGMUX peripheral base pointers */
#define TRGMUX_BASE_PTRS                         { TRGMUX }

/* TSPC - Peripheral instance base addresses */
/** Peripheral TSPC base address */
#define TSPC_BASE                                (0x402C4000u)
/** Peripheral TSPC base pointer */
#define TSPC                                     ((TSPC_Type *)TSPC_BASE)
/** Array initializer of TSPC peripheral base addresses */
#define TSPC_BASE_ADDRS                          { TSPC_BASE }
/** Array initializer of TSPC peripheral base pointers */
#define TSPC_BASE_PTRS                           { TSPC }

