zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/MCXE327/MCXE327_cm7_core1_COMMON.h
/* VIRT_WRAPPER - Peripheral instance base addresses */
/** Peripheral VIRT_WRAPPER base address */
#define VIRT_WRAPPER_BASE                        (0x402A8000u)
/** Peripheral VIRT_WRAPPER base pointer */
#define VIRT_WRAPPER                             ((VIRT_WRAPPER_Type *)VIRT_WRAPPER_BASE)
/** Array initializer of VIRT_WRAPPER peripheral base addresses */
#define VIRT_WRAPPER_BASE_ADDRS                  { VIRT_WRAPPER_BASE }
/** Array initializer of VIRT_WRAPPER peripheral base pointers */
#define VIRT_WRAPPER_BASE_PTRS                   { VIRT_WRAPPER }

/* WKPU - Peripheral instance base addresses */
/** Peripheral WKPU base address */
#define WKPU_BASE                                (0x402B4000u)
/** Peripheral WKPU base pointer */
#define WKPU                                     ((WKPU_Type *)WKPU_BASE)
/** Array initializer of WKPU peripheral base addresses */
#define WKPU_BASE_ADDRS                          { WKPU_BASE }
/** Array initializer of WKPU peripheral base pointers */
#define WKPU_BASE_PTRS                           { WKPU }

/* XBIC - Peripheral instance base addresses */
/** Peripheral XBIC_AXBS base address */
#define XBIC_AXBS_BASE                           (0x40204000u)
/** Peripheral XBIC_AXBS base pointer */
#define XBIC_AXBS                                ((XBIC_Type *)XBIC_AXBS_BASE)
/** Peripheral XBIC_AXBS_EDMA base address */
#define XBIC_AXBS_EDMA_BASE                      (0x40404000u)
/** Peripheral XBIC_AXBS_EDMA base pointer */
#define XBIC_AXBS_EDMA                           ((XBIC_Type *)XBIC_AXBS_EDMA_BASE)
/** Peripheral XBIC_AXBS_PERI base address */
#define XBIC_AXBS_PERI_BASE                      (0x40208000u)
/** Peripheral XBIC_AXBS_PERI base pointer */
#define XBIC_AXBS_PERI                           ((XBIC_Type *)XBIC_AXBS_PERI_BASE)
/** Peripheral XBIC_AXBS_TCM base address */
#define XBIC_AXBS_TCM_BASE                       (0x40400000u)
/** Peripheral XBIC_AXBS_TCM base pointer */
#define XBIC_AXBS_TCM                            ((XBIC_Type *)XBIC_AXBS_TCM_BASE)
/** Array initializer of XBIC peripheral base addresses */
#define XBIC_BASE_ADDRS                          { XBIC_AXBS_BASE, XBIC_AXBS_EDMA_BASE, XBIC_AXBS_PERI_BASE, XBIC_AXBS_TCM_BASE }
/** Array initializer of XBIC peripheral base pointers */
#define XBIC_BASE_PTRS                           { XBIC_AXBS, XBIC_AXBS_EDMA, XBIC_AXBS_PERI, XBIC_AXBS_TCM }

/* XRDC - Peripheral instance base addresses */
/** Peripheral XRDC base address */
#define XRDC_BASE                                (0x40278000u)
/** Peripheral XRDC base pointer */
#define XRDC                                     ((XRDC_Type *)XRDC_BASE)
/** Array initializer of XRDC peripheral base addresses */
#define XRDC_BASE_ADDRS                          { XRDC_BASE }
/** Array initializer of XRDC peripheral base pointers */
#define XRDC_BASE_PTRS                           { XRDC }

/* ----------------------------------------------------------------------------
   -- Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Bit_Field_Generic_Macros Macros for use with bit field definitions (xxx_SHIFT, xxx_MASK).
 * @{
 */

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang system_header
  #endif
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma system_include
#endif

/**
 * @brief Mask and left-shift a bit field value for use in a register bit range.
 * @param field Name of the register bit field.
 * @param value Value of the bit field.
 * @return Masked and shifted value.
 */
#define NXP_VAL2FLD(field, value)    (((value) << (field ## _SHIFT)) & (field ## _MASK))
/**
 * @brief Mask and right-shift a register value to extract a bit field value.
 * @param field Name of the register bit field.
 * @param value Value of the register.
 * @return Masked and shifted bit field value.
 */
#define NXP_FLD2VAL(field, value)    (((value) & (field ## _MASK)) >> (field ## _SHIFT))

/*!
 * @}
 */ /* end of group Bit_Field_Generic_Macros */


/* ----------------------------------------------------------------------------
   -- SDK Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup SDK_Compatibility_Symbols SDK Compatibility
 * @{
 */

/* No SDK compatibility issues. */

/*!
 * @}
 */ /* end of group SDK_Compatibility_Symbols */


#endif  /* MCXE327_CM7_CORE1_COMMON_H_ */

